app/views/users/show.html.erb

SELECT COUNT(*) FROM "books" WHERE "books"."user_id" = ? AND (created_at > '2021-11-09')  [["user_id", 2]]
---
      <%= render 'books/index',books: @books %>
      <!--%= current_user.books.where('created_at > ?', Date.today).count %>-->