app/controllers/books_controller.rb

SELECT "books".* FROM "books"
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 1], ["id", 2]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ? AND "favorites"."created_at" >= ? AND "favorites"."created_at" < ?  [["book_id", 2], ["created_at", "2021-11-07 00:00:00"], ["created_at", "2021-11-09 23:59:59.999999"]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."book_id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?)  [["book_id", 1], ["book_id", 2], ["book_id", 3], ["book_id", 4], ["book_id", 5], ["book_id", 6], ["book_id", 7], ["book_id", 8], ["book_id", 9]]
SELECT COUNT(*) FROM "users" INNER JOIN "favorites" ON "users"."id" = "favorites"."user_id" WHERE "favorites"."book_id" = ? AND "users"."created_at" >= ? AND "users"."created_at" < ?  [["book_id", 2], ["created_at", "2021-11-05 00:00:00"], ["created_at", "2021-11-11 23:59:59.999999"]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."book_id" IN (?, ?, ?, ?)  [["book_id", 1], ["book_id", 2], ["book_id", 3], ["book_id", 4]]
SELECT COUNT(*) FROM "users" INNER JOIN "favorites" ON "users"."id" = "favorites"."user_id" WHERE "favorites"."book_id" = ? AND "users"."created_at" >= ? AND "users"."created_at" < ?  [["book_id", 1], ["created_at", "2021-11-05 00:00:00"], ["created_at", "2021-11-11 23:59:59.999999"]]
---
  def index
    to  = Time.current.at_end_of_day
    from  = (to - 6.day).at_beginning_of_day
    @books = Book.includes(:favorited_users).
      sort {|a,b|
        b.favorited_users.includes(:favorites).where(created_at: from...to).size <=>
        a.favorited_users.includes(:favorites).where(created_at: from...to).size